<template>
  <!-- <a-button type="primary" @click="onAdd">新增</a-button> -->
  <Teleport to="body">
    <div class="msg-list">
      <TransitionGroup name="fade" tag="div" class="container">
        <div class="item" v-for="(item, index) in msgList" :key="item.id">
          <CheckCircleOutlined v-if="item.type === 'success'" class="left-icon color-green text-24" />
          <CloseCircleOutlined v-if="item.type === 'error'" class="left-icon color-red text-24" />
          <div class="title">{{ item.title }}</div>
          <div class="desc" v-for="(item2, index2) in item.desc" :key="index2">{{ item2 }}</div>
          <!-- <close-outlined class="close" @click="closeItem(item, index)" /> -->
          <div class="time">{{ item.time }}</div>
        </div>
      </TransitionGroup>
    </div>
  </Teleport>


  <a-popover overlayClassName="msg-list-popover" v-model:open="showMsgPopover" placement="topRight" trigger="click"
    :title="t('消息通知')">

    <a-float-button :badge="{ count: allMsgList.length }" :style="{ bottom: '130px', right: '16px', 'zIndex': 1000 }">
      <template #icon>
        <span class="anticon color-blue">
          <svg v-if="!isDarkMode" xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 36 36"
            fill="none">
            <path
              d="M7.96992 19.3729L6.97629 19.2601L7.96992 19.3729ZM8.6407 13.4628L9.63432 13.5756L8.6407 13.4628ZM6.67168 22.3082L5.9102 21.66H5.9102L6.67168 22.3082ZM29.0237 19.2601C28.9614 18.7114 28.4661 18.317 27.9173 18.3793C27.3686 18.4415 26.9742 18.9369 27.0365 19.4857L29.0237 19.2601ZM29.3283 22.3082L28.5668 22.9564L29.3283 22.3082ZM14.5951 6.56049L14.919 7.50657C15.3234 7.36811 15.5951 6.98793 15.5951 6.56049H14.5951ZM19.8257 4.83946C20.1855 5.25849 20.8168 5.30654 21.2359 4.94677C21.6549 4.587 21.7029 3.95566 21.3432 3.53663L19.8257 4.83946ZM23.4364 30.3509C23.6302 29.8338 23.3681 29.2574 22.8509 29.0636C22.3338 28.8698 21.7574 29.1319 21.5636 29.6491L23.4364 30.3509ZM14.4364 29.6491C14.2426 29.1319 13.6662 28.8698 13.1491 29.0636C12.6319 29.2574 12.3698 29.8338 12.5636 30.3509L14.4364 29.6491ZM30.5 10.5C30.5 12.433 28.933 14 27 14V16C30.0376 16 32.5 13.5376 32.5 10.5H30.5ZM27 14C25.067 14 23.5 12.433 23.5 10.5H21.5C21.5 13.5376 23.9624 16 27 16V14ZM23.5 10.5C23.5 8.567 25.067 7 27 7V5C23.9624 5 21.5 7.46243 21.5 10.5H23.5ZM27 7C28.933 7 30.5 8.567 30.5 10.5H32.5C32.5 7.46243 30.0376 5 27 5V7ZM26.6658 26H9.33422V28H26.6658V26ZM8.96354 19.4857L9.63432 13.5756L7.64708 13.35L6.97629 19.2601L8.96354 19.4857ZM7.43316 22.9564C8.28385 21.957 8.81916 20.7577 8.96354 19.4857L6.97629 19.2601C6.87904 20.117 6.51647 20.9478 5.9102 21.66L7.43316 22.9564ZM27.0365 19.4857C27.1808 20.7577 27.7162 21.957 28.5668 22.9564L30.0898 21.66C29.4835 20.9478 29.121 20.117 29.0237 19.2601L27.0365 19.4857ZM9.33422 26C8.30847 26 7.571 25.4914 7.22712 24.8855C6.89311 24.2969 6.89939 23.5834 7.43316 22.9564L5.9102 21.66C4.79842 22.9661 4.76469 24.5985 5.48769 25.8726C6.20083 27.1292 7.6174 28 9.33422 28V26ZM26.6658 28C28.3826 28 29.7992 27.1292 30.5123 25.8726C31.2353 24.5985 31.2016 22.9661 30.0898 21.66L28.5668 22.9564C29.1006 23.5834 29.1069 24.2969 28.7729 24.8855C28.429 25.4914 27.6915 26 26.6658 26V28ZM15.5951 6.56049V6.40492H13.5951V6.56049H15.5951ZM9.63432 13.5756C9.9452 10.8365 12.0058 8.50403 14.919 7.50657L14.2712 5.61441C10.7572 6.81755 8.05959 9.71545 7.64708 13.35L9.63432 13.5756ZM18 2C15.5672 2 13.5951 3.97215 13.5951 6.40492H15.5951C15.5951 5.07672 16.6718 4 18 4V2ZM18 4C18.7299 4 19.3831 4.32397 19.8257 4.83946L21.3432 3.53663C20.5368 2.59747 19.3377 2 18 2V4ZM21.5636 29.6491C21.0605 30.9914 19.6769 32 18 32V34C20.4781 34 22.6294 32.5042 23.4364 30.3509L21.5636 29.6491ZM18 32C16.3231 32 14.9395 30.9914 14.4364 29.6491L12.5636 30.3509C13.3706 32.5042 15.5219 34 18 34V32Z"
              fill="currentColor" />
          </svg>

          <svg v-if="isDarkMode" xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 26 30"
            fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd"
              d="M3.33422 24.0004H20.6658C23.4083 24.0004 24.9739 21.2417 23.3283 19.3085C22.5998 18.4527 22.1509 17.4377 22.0301 16.3733L21.784 14.2049C21.5268 14.2347 21.2651 14.25 20.9999 14.25C17.272 14.25 14.2499 11.2279 14.2499 7.5C14.2499 6.04369 14.7111 4.6951 15.4954 3.59231C15.4653 3.58169 15.4352 3.57121 15.4049 3.56086V3.40529C15.4049 1.5248 13.8805 0.000366211 12 0.000366211C10.1195 0.000366211 8.59508 1.5248 8.59508 3.40529V3.56086C5.38149 4.66115 3.00239 7.27632 2.6407 10.4631L1.96992 16.3733C1.8491 17.4377 1.40016 18.4527 0.671678 19.3085C-0.973864 21.2417 0.591651 24.0004 3.33422 24.0004ZM25.5 7.5C25.5 9.98528 23.4853 12 21 12C18.5147 12 16.5 9.98528 16.5 7.5C16.5 5.01472 18.5147 3 21 3C23.4853 3 25.5 5.01472 25.5 7.5ZM12 30.0004C14.0348 30.0004 15.7721 28.7992 16.4581 27.1077C16.4868 27.0371 16.5 26.9614 16.5 26.8852C16.5 26.5344 16.2156 26.25 15.8648 26.25H8.13524C7.78441 26.25 7.5 26.5344 7.5 26.8852C7.5 26.9614 7.51324 27.0371 7.54186 27.1077C8.22792 28.7992 9.96522 30.0004 12 30.0004Z"
              fill="currentColor" />
          </svg>

        </span>
      </template>
    </a-float-button>

    <template #content>
      <div class="popover-content">


        <div class="close-icon flex-center" v-if="allMsgList.length" @click.stop="closeAll">

          <span class="anticon mr4 text-16">
            <svg xmlns="http://www.w3.org/2000/svg" width="1em" height="1em" viewBox="0 0 20 20" fill="none">
              <g clip-path="url(#clip0_565_6783)">
                <path
                  d="M15.0003 9.91664V15C15.0003 16.8409 13.5079 18.3333 11.667 18.3333H5.00033C3.15938 18.3333 1.66699 16.8409 1.66699 15V8.33332C1.66699 6.49237 3.15938 4.99999 5.00033 4.99999H10.0837M15.0003 9.91664C16.9022 9.53058 18.3337 7.84912 18.3337 5.83332C18.3337 3.53214 16.4682 1.66666 14.167 1.66666C12.1512 1.66666 10.4697 3.09812 10.0837 4.99999M15.0003 9.91664C14.7311 9.9713 14.4524 9.99999 14.167 9.99999C11.8658 9.99999 10.0003 8.13451 10.0003 5.83332C10.0003 5.54793 10.029 5.26925 10.0837 4.99999"
                  stroke="currentColor" stroke-width="1.5" stroke-linejoin="round" />
              </g>
              <defs>
                <clipPath id="clip0_565_6783">
                  <rect width="20" height="20" fill="white" />
                </clipPath>
              </defs>
            </svg>
          </span>
          {{ t('清空信息') }}
        </div>

        <div class="no-data" v-if="!allMsgList.length">
          <svg v-if="!isDarkMode" xmlns="http://www.w3.org/2000/svg" width="133" height="119" viewBox="0 0 133 119"
            fill="none">
            <g clip-path="url(#clip0_565_6840)">
              <path
                d="M70.2996 118.62C98.2996 118.62 121 95.92 121 67.82C121 39.72 98.1996 17.02 70.2996 17.02C42.2996 17.02 19.5996 39.72 19.5996 67.82C19.5996 95.92 42.2996 118.62 70.2996 118.62Z"
                fill="#F1F3F9" stroke="#D6DCE8" stroke-width="2" />
              <path
                d="M124.15 100.6C126.415 100.6 128.25 98.76 128.25 96.5C128.25 94.24 126.415 92.4 124.15 92.4C121.886 92.4 120.05 94.24 120.05 96.5C120.05 98.76 121.886 100.6 124.15 100.6Z"
                fill="#EFF2F8" />
              <path
                d="M130.15 84.6C131.697 84.6 132.95 83.35 132.95 81.8C132.95 80.25 131.697 79 130.15 79C128.604 79 127.35 80.25 127.35 81.8C127.35 83.35 128.604 84.6 130.15 84.6Z"
                fill="#EFF2F8" />
              <path
                d="M22.3 34.42C23.847 34.42 25.1 33.17 25.1 31.62C25.1 30.08 23.847 28.82 22.3 28.82C20.754 28.82 19.5 30.08 19.5 31.62C19.5 33.17 20.754 34.42 22.3 34.42Z"
                fill="#EFF2F8" />
              <path
                d="M5.2 88.42C8.072 88.42 10.4 86.09 10.4 83.22C10.4 80.35 8.072 78.02 5.2 78.02C2.329 78.02 0 80.35 0 83.22C0 86.09 2.329 88.42 5.2 88.42Z"
                fill="#EFF2F8" />
              <path
                d="M76.662 86.24H65.395C62.784 86.24 60.585 88.65 60.585 91.51V97.68C60.585 104 65.257 109.12 71.028 109.12C76.799 109.12 81.471 104 81.471 97.68V91.51C81.471 88.5 79.272 86.24 76.662 86.24Z"
                fill="white" stroke="#D6DCE8" stroke-width="2" />
              <path
                d="M75.662 27.11C86.686 29.66 94.898 39.53 94.898 51.33V54.49C94.898 81.14 114.959 98.58 114.959 98.58H24.959C24.959 98.58 45.158 81.14 45.158 54.49V51.33C45.158 39.53 53.37 29.66 64.395 27.11V26.05C64.395 22.89 66.868 20.42 70.028 20.42C73.188 20.42 75.662 22.89 75.662 26.05V27.11Z"
                fill="white" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M70.0285 21.42C67.4205 21.42 65.3955 23.45 65.3955 26.05V27.11V27.9L64.6205 28.08L64.3961 27.11L64.1695 26.13C63.9099 26.19 63.6519 26.2538 63.3955 26.3215V26.05C63.3955 22.34 66.3165 19.42 70.0285 19.42C73.7405 19.42 76.6625 22.34 76.6625 26.05V26.3218C76.4057 26.254 76.1473 26.19 75.8875 26.13L75.6608 27.11L75.437 28.0778L75.6625 27.11H76.6625V26.3218C87.7382 29.2465 95.8985 39.3283 95.8985 51.33V54.49C95.8985 67.56 100.819 78.39 105.767 85.98C108.239 89.77 110.711 92.74 112.562 94.76C113.487 95.77 114.257 96.54 114.792 97.06C115.023 97.285 115.211 97.4575 115.349 97.5842L115.349 97.5848L115.35 97.5851L115.409 97.64C115.463 97.6937 115.507 97.7297 115.54 97.7572C115.55 97.7655 115.559 97.773 115.567 97.78L115.574 97.787L115.582 97.7957L115.594 97.8069L115.594 97.8069L115.599 97.8123C115.602 97.815 115.604 97.8175 115.606 97.82C115.61 97.82 115.613 97.82 115.614 97.83H115.616L117.633 99.58H114.959H24.9595H22.2725L24.3065 97.82L24.3068 97.8204L24.3065 97.8221L24.3065 97.83H24.3056C24.3074 97.8304 24.3316 97.8492 24.9595 98.58C25.6135 99.34 25.6135 99.34 25.6145 99.34H25.6155C25.6159 99.34 25.6163 99.3383 25.6168 99.3363C25.6175 99.3334 25.6183 99.33 25.6195 99.33C25.6225 99.33 25.6275 99.33 25.6325 99.32C25.6367 99.3161 25.6417 99.3123 25.6475 99.3078L25.6475 99.3078C25.6566 99.3007 25.6676 99.2922 25.6805 99.28C25.704 99.2571 25.7337 99.2309 25.7693 99.1995C25.7958 99.1761 25.8256 99.1499 25.8585 99.12C26.0135 98.98 26.2365 98.77 26.5195 98.5C26.7827 98.2489 27.0971 97.9416 27.455 97.58H112.474C112.83 97.9416 113.142 98.2489 113.403 98.5C113.684 98.77 113.906 98.98 114.06 99.12C114.095 99.1523 114.127 99.1803 114.155 99.205C114.178 99.2251 114.198 99.243 114.216 99.2592C114.223 99.2665 114.231 99.2734 114.237 99.28C114.257 99.3 114.273 99.31 114.284 99.32C114.29 99.32 114.294 99.33 114.297 99.33H114.301L114.302 99.34C114.303 99.34 114.303 99.34 114.959 98.58V97.58H112.474C112.065 97.1641 111.599 96.6764 111.088 96.12C109.177 94.03 106.634 90.97 104.091 87.07C99.0095 79.28 93.8985 68.07 93.8985 54.49V51.33C93.8985 40.01 86.0185 30.53 75.4365 28.08L74.6625 27.9V27.11V26.05C74.6625 23.45 72.6365 21.42 70.0285 21.42ZM27.455 97.58H24.9595V98.58L24.3068 97.8204L24.307 97.8201L24.3075 97.82H24.3165C24.3202 97.8153 24.3251 97.8105 24.3312 97.8047L24.3313 97.8046L24.3315 97.8045C24.3381 97.7981 24.3461 97.7904 24.3555 97.78C24.3688 97.7685 24.3848 97.7542 24.4035 97.7374C24.4336 97.7103 24.4706 97.6771 24.5145 97.64L24.5702 97.5891L24.5704 97.5889C24.7094 97.4618 24.8999 97.2878 25.1365 97.06C25.6745 96.54 26.4495 95.77 27.3815 94.76C29.2455 92.74 31.7345 89.77 34.2235 85.98C39.2055 78.39 44.1585 67.56 44.1585 54.49L44.1585 51.33C44.1585 39.3279 52.3192 29.2458 63.3955 26.3215V27.11H64.3955L64.6205 28.08C54.0395 30.53 46.1585 40.01 46.1585 51.33L46.1585 54.49C46.1585 68.07 41.0125 79.28 35.8955 87.08C33.3345 90.98 30.7745 94.03 28.8505 96.12C28.3358 96.6764 27.8667 97.1641 27.455 97.58Z"
                fill="#D6DCE8" />
              <path
                d="M59.5853 65.34C56.1503 65.34 53.2653 63.14 52.1663 59.98C51.8913 59.3 52.3033 58.61 52.9903 58.33C53.6773 58.06 54.3643 58.47 54.6393 59.16C55.3263 61.22 57.3873 62.73 59.5853 62.73C61.7843 62.73 63.8453 61.36 64.5323 59.16C64.8073 58.47 65.4943 58.06 66.1813 58.33C66.8683 58.61 67.2803 59.3 67.0053 59.98C65.9063 63.28 63.0203 65.34 59.5853 65.34Z"
                fill="#AAB2C5" />
              <path
                d="M80.3333 65.34C76.8983 65.34 74.0133 63.14 72.9143 59.98C72.6393 59.3 73.0513 58.61 73.7383 58.33C74.4253 58.06 75.1123 58.47 75.3873 59.16C76.0743 61.22 78.1353 62.73 80.3333 62.73C82.5323 62.73 84.5933 61.36 85.2803 59.16C85.5553 58.47 86.2423 58.06 86.9293 58.33C87.6163 58.61 88.0283 59.3 87.7533 59.98C86.6543 63.28 83.7693 65.34 80.3333 65.34Z"
                fill="#AAB2C5" />
              <path
                d="M70.0282 82.16C71.7742 82.16 73.1882 80.74 73.1882 79C73.1882 77.25 71.7742 75.84 70.0282 75.84C68.2832 75.84 66.8682 77.25 66.8682 79C66.8682 80.74 68.2832 82.16 70.0282 82.16Z"
                fill="#AAB2C5" />
              <path d="M86.9621 4.65V0H104.933V4.65L92.6711 19.45H105.144V24.1H86.3281V19.45L98.5901 4.65H86.9621Z"
                fill="#AAB2C5" />
              <path
                d="M101.761 39.52V36.56H113.389V39.52L105.567 49.03H113.6V51.99H101.338V49.03L109.161 39.52H101.761Z"
                fill="#AAB2C5" />
            </g>
            <defs>
              <clipPath id="clip0_565_6840">
                <rect width="132.95" height="118.62" fill="white" />
              </clipPath>
            </defs>
          </svg>

          <svg v-if="isDarkMode" xmlns="http://www.w3.org/2000/svg" width="133" height="119" viewBox="0 0 133 119"
            fill="none">
            <g clip-path="url(#clip0_926_6047)">
              <path
                d="M70.3 118.62C98.3 118.62 121 95.92 121 67.82C121 39.72 98.2 17.02 70.3 17.02C42.3 17.02 19.6 39.72 19.6 67.82C19.6 95.92 42.3 118.62 70.3 118.62Z"
                fill="#2D2E31" />
              <path
                d="M124.15 100.6C126.415 100.6 128.25 98.7599 128.25 96.4999C128.25 94.2399 126.415 92.3999 124.15 92.3999C121.886 92.3999 120.05 94.2399 120.05 96.4999C120.05 98.7599 121.886 100.6 124.15 100.6Z"
                fill="#3C3C3F" />
              <path
                d="M130.15 84.6C131.697 84.6 132.95 83.35 132.95 81.8C132.95 80.25 131.697 79 130.15 79C128.604 79 127.35 80.25 127.35 81.8C127.35 83.35 128.604 84.6 130.15 84.6Z"
                fill="#3C3C3F" />
              <path
                d="M22.3 34.4201C23.847 34.4201 25.1 33.1701 25.1 31.6201C25.1 30.0801 23.847 28.8201 22.3 28.8201C20.754 28.8201 19.5 30.0801 19.5 31.6201C19.5 33.1701 20.754 34.4201 22.3 34.4201Z"
                fill="#3C3C3F" />
              <path
                d="M5.2 88.42C8.072 88.42 10.4 86.09 10.4 83.22C10.4 80.35 8.072 78.02 5.2 78.02C2.329 78.02 0 80.35 0 83.22C0 86.09 2.329 88.42 5.2 88.42Z"
                fill="#3C3C3F" />
              <path
                d="M76.662 86.24H65.395C62.784 86.24 60.585 88.65 60.585 91.51V97.68C60.585 104 65.257 109.12 71.028 109.12C76.799 109.12 81.471 104 81.471 97.68V91.51C81.471 88.5 79.272 86.24 76.662 86.24Z"
                fill="#48494C" stroke="#1E1F21" stroke-width="2" />
              <path
                d="M75.662 27.1099C86.686 29.6599 94.898 39.5299 94.898 51.3299V54.4899C94.898 81.1399 114.959 98.5799 114.959 98.5799H24.959C24.959 98.5799 45.158 81.1399 45.158 54.4899V51.3299C45.158 39.5299 53.37 29.6599 64.395 27.1099V26.0499C64.395 22.8899 66.868 20.4199 70.028 20.4199C73.188 20.4199 75.662 22.8899 75.662 26.0499V27.1099Z"
                fill="#48494C" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M70.028 21.4199C67.42 21.4199 65.395 23.4499 65.395 26.0499V27.1099V27.8999L64.62 28.0799C54.039 30.5299 46.158 40.0099 46.158 51.3299L46.158 54.4899C46.158 68.0699 41.012 79.2799 35.895 87.0799C33.334 90.9799 30.774 94.0299 28.85 96.1199C28.3353 96.6763 27.8662 97.164 27.4545 97.5799H112.474C112.065 97.164 111.599 96.6763 111.088 96.1199C109.177 94.0299 106.634 90.9699 104.091 87.0699C99.009 79.2799 93.898 68.0699 93.898 54.4899V51.3299C93.898 40.0099 86.018 30.5299 75.436 28.0799L74.662 27.8999V27.1099V26.0499C74.662 23.4499 72.636 21.4199 70.028 21.4199ZM76.662 26.3217C87.7377 29.2464 95.898 39.3282 95.898 51.3299V54.4899C95.898 67.5599 100.819 78.3899 105.767 85.9799C108.239 89.7699 110.711 92.7399 112.562 94.7599C113.487 95.7699 114.257 96.5399 114.792 97.0599C115.023 97.2849 115.211 97.4574 115.348 97.5841L115.349 97.5847L115.349 97.585L115.409 97.6399C115.463 97.6936 115.506 97.7297 115.54 97.7571C115.55 97.7654 115.559 97.7729 115.567 97.7799L115.573 97.7869L115.582 97.7956L115.593 97.8068L115.593 97.8068L115.599 97.8122C115.601 97.8149 115.604 97.8174 115.606 97.8199C115.61 97.8199 115.613 97.8199 115.614 97.8299H115.616L117.633 99.5799H114.959H24.959H22.272L24.306 97.8199L24.3063 97.8203L24.3065 97.82L24.307 97.8199H24.316C24.3198 97.8152 24.3247 97.8105 24.3307 97.8047L24.3308 97.8046L24.331 97.8044C24.3376 97.798 24.3456 97.7903 24.355 97.7799C24.3683 97.7685 24.3843 97.7541 24.403 97.7373C24.4331 97.7103 24.4701 97.677 24.514 97.6399L24.5697 97.589L24.5699 97.5888C24.709 97.4617 24.8994 97.2877 25.136 97.0599C25.674 96.5399 26.449 95.7699 27.381 94.7599C29.245 92.7399 31.734 89.7699 34.223 85.9799C39.205 78.3899 44.158 67.5599 44.158 54.4899L44.158 51.3299C44.158 39.3278 52.3187 29.2458 63.395 26.3215V26.0499C63.395 22.3399 66.316 19.4199 70.028 19.4199C73.74 19.4199 76.662 22.3399 76.662 26.0499V26.3217Z"
                fill="#1E1F21" />
              <path
                d="M59.585 65.3399C56.15 65.3399 53.265 63.1399 52.166 59.9799C51.891 59.2999 52.303 58.6099 52.99 58.3299C53.677 58.0599 54.364 58.4699 54.639 59.1599C55.326 61.2199 57.387 62.7299 59.585 62.7299C61.784 62.7299 63.845 61.3599 64.532 59.1599C64.807 58.4699 65.494 58.0599 66.181 58.3299C66.868 58.6099 67.28 59.2999 67.005 59.9799C65.906 63.2799 63.02 65.3399 59.585 65.3399Z"
                fill="#1E1F21" />
              <path
                d="M80.333 65.3399C76.898 65.3399 74.013 63.1399 72.914 59.9799C72.639 59.2999 73.051 58.6099 73.738 58.3299C74.425 58.0599 75.112 58.4699 75.387 59.1599C76.074 61.2199 78.135 62.7299 80.333 62.7299C82.532 62.7299 84.593 61.3599 85.28 59.1599C85.555 58.4699 86.242 58.0599 86.929 58.3299C87.616 58.6099 88.028 59.2999 87.753 59.9799C86.654 63.2799 83.769 65.3399 80.333 65.3399Z"
                fill="#1E1F21" />
              <path
                d="M70.028 82.1601C71.774 82.1601 73.188 80.7401 73.188 79.0001C73.188 77.2501 71.774 75.8401 70.028 75.8401C68.283 75.8401 66.868 77.2501 66.868 79.0001C66.868 80.7401 68.283 82.1601 70.028 82.1601Z"
                fill="#1E1F21" />
              <path d="M86.962 4.65V0H104.933V4.65L92.671 19.45H105.144V24.1H86.328V19.45L98.59 4.65H86.962Z"
                fill="#48494C" />
              <path
                d="M101.761 39.5201V36.5601H113.389V39.5201L105.567 49.0301H113.6V51.9901H101.338V49.0301L109.161 39.5201H101.761Z"
                fill="#48494C" />
            </g>
            <defs>
              <clipPath id="clip0_926_6047">
                <rect width="132.95" height="118.62" fill="white" />
              </clipPath>
            </defs>
          </svg>
          <span class="mt16">{{ t('暂无消息通知') }}</span>
        </div>

        <div class="popover-msg-list" v-if="allMsgList.length">
          <div class="item" :class="[item.type === 'error' ? 'item-error' : 'item-success']"
            v-for="(item, index) in allMsgList" :key="item.id">
            <CheckCircleOutlined v-if="item.type === 'success'" class="left-icon color-green text-24" />
            <CloseCircleOutlined v-if="item.type === 'error'" class="left-icon color-red text-24" />
            <div class="title">{{ item.title }}</div>
            <div class="desc" v-for="(item2, index2) in item.desc" :key="index2">{{ item2 }}</div>
            <div class="time">{{ item.time }}</div>
          </div>
        </div>
      </div>

    </template>
  </a-popover>

</template>

<script lang="ts" setup>
import { getRandomId } from '@u/utils'
import { useWebSocket } from '@/hooks/useWebSocket'

import { storeToRefs } from 'pinia'
import { useThemeStore } from '@/store/theme'

const { t, locale } = useI18n()

const { isDarkMode } = storeToRefs(useThemeStore())

const userId = JSON.parse(localStorage.getItem('userInfo') || '{}')?.id // 用户id

const lang = {
  'zh-CN': 'zh-hans',
  'en-US': 'en',
}[locale.value]

// 连接websocket时把语言也发给后台
const wsUrl = `${import.meta.env.VITE_WS_BASE_URL}notification/${userId}?lang=${lang}`

const { connection } = useWebSocket(wsUrl)

// 监听最后一条消息
// 更新UI或处理新消息
watch(connection.lastMessage, (message) => {
  // console.log('message :>> ', message)
  if (message?.code) {
    if (message.code === 200) {
      openNotification('success', message)
    } else {
      openNotification('error', message)
    }
  }
})

// 收到消息后，打开通知框
function openNotification(type: string, message: any) {
  // websocket描述根据\n换行
  const msgList: string[] = message.msg.split('\n')
  addNewMsg({
    type: type,
    title: message.title,
    desc: msgList
  })
}

const msgList = ref<any[]>([])
const allMsgList = ref<any[]>([])

// 新增通知
function addNewMsg(content: any) {
  const now = new Date()
  const data = {
    id: getRandomId(),
    type: content.type,
    title: content.title,
    desc: content.desc,
    time: now.toLocaleTimeString()
  }
  msgList.value.unshift(data)

  // 3秒后自动移除该通知
  setTimeout(() => {
    closeItem(content, 0)
  }, 3000)

  allMsgList.value.unshift(data)

}

function onAdd() {
  const now = new Date()
  const data = {
    id: getRandomId(),
    type: 'success',
    title: t('标题') + new Date().getTime(),
    desc: ['lorem'],
    time: now.toLocaleTimeString()
  }
  msgList.value.unshift(data)

  // 3秒后自动移除该通知
  setTimeout(() => {
    closeItem(msgList.value[0], 0)
  }, 11113000)

  allMsgList.value.unshift(data)

}

function closeItem(item: any, index: number) {
  msgList.value.splice(index, 1)
}


const showMsgPopover = ref(false)

// 清空信息
function closeAll() {
  allMsgList.value = []
  setTimeout(() => {
    showMsgPopover.value = false
  }, 800)
}
</script>

<style lang="less">
.ant-popover.msg-list-popover {

  .ant-popover-title {
    margin: 0 16px;
    padding: 16px 0;
    font-size: 16px;
    font-weight: 500;
    // color: var(--color-t2);

    &:before {
      content: '';
      display: inline;
      border-left: 4px solid var(--color-modal-title-before);
      border-right: 4px solid var(--color-modal-title-before);
      border-radius: 2px;
      margin-right: 16px;
    }
  }
}

// 悬浮按钮加个边框
.ant-float-btn-default .ant-float-btn-body {
  border: 1px solid var(--color-primary-02);
  background-color: var(--color-bg);
}
</style>


<style lang="less" scoped>
.msg-list {
  position: fixed;
  top: 76px;
  right: 8px;
  z-index: 999;

  .item {
    position: relative;
    width: 350px;
    padding: 12px 16px;
    margin-bottom: 8px;
    background: #fff;
    font-size: 14px;
    border-radius: 4px;
    box-shadow: 0 6px 16px 0 rgba(0, 0, 0, 0.08), 0 3px 6px -4px rgba(0, 0, 0, 0.12), 0 9px 28px 8px rgba(0, 0, 0, 0.05);
    overflow: hidden;

    .left-icon {
      position: absolute;
      top: 12px;
      left: 12px;
    }

    .title {
      font-size: 16px;
      margin-left: 30px;
      font-weight: 500;
      white-space: nowrap;
      text-overflow: ellipsis;
      color: var(--black-t2);
    }

    .desc {
      margin-top: 8px;
      margin-left: 30px;
      color: var(--black-t3);
      word-break: break-all;
    }

    .time {
      position: absolute;
      top: 14px;
      right: 16px;
      color: var(--black-t5);
      font-size: 12px;
    }

    // .close {
    //   position: absolute;
    //   top: 15px;
    //   right: 12px;
    //   color: var(--color-t5);
    //   transition: all.2s;

    //   &:hover {
    //     color: var(--color-t2);
    //   }
    // }
  }
}

// 暗色模式就用护眼的颜色吧
.dark,
.eyecare {
  .msg-list {
    .item {
      background: var(--eyecare-bg-light);

      .title {
        color: var(--eyecare-t1);
      }

      .desc {
        color: var(--eyecare-t3);
      }

      .time {
        color: var(--eyecare-t5);
      }
    }
  }
}

/* 1. 声明过渡效果 */
.fade-move,
.fade-enter-active,
.fade-leave-active {
  transition: all 0.3s cubic-bezier(0.55, 0, 0.1, 1);
}

/* 2. 声明进入和离开的状态 */
.fade-enter-from,
.fade-leave-to {
  opacity: 0;
  transform: scaleY(0.01) translate(30px, 0);
}

/* 3. 确保离开的项目被移除出了布局流
      以便正确地计算移动时的动画效果。 */
.fade-leave-active {
  position: absolute;
}




.popover-content {
  width: 500px;
  height: 530px;
  padding-right: 1px;
  overflow-y: scroll;

  &::-webkit-scrollbar {
    width: 2px;
  }

  .no-data {
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    padding-top: 150px;
  }
}





.popover-msg-list {
  width: 100%;
  font-size: 14px;

  .item {
    position: relative;
    width: 100%;
    padding: 12px 16px;
    margin-bottom: 8px;
    background: #fff; // 默认的，会被覆盖
    font-size: 14px;
    border-radius: 4px;
    overflow: hidden;

    &.item-success {
      border: 1px solid var(--color-green-02);
      background: var(--color-green-005);
    }

    &.item-error {
      border: 1px solid var(--color-red-02);
      background: var(--color-red-005);
    }

    .left-icon {
      position: absolute;
      top: 12px;
      left: 12px;
    }

    .title {
      font-size: 16px;
      margin-left: 30px;
      font-weight: 500;
      white-space: nowrap;
      text-overflow: ellipsis;
      // color: var(--color-t2);
    }

    .desc {
      margin-top: 4px;
      margin-left: 30px;
      color: var(--color-gray);
      word-break: break-all;
    }

    .time {
      position: absolute;
      top: 12px;
      right: 16px;
      color: var(--color-gray);
      font-size: 12px;
    }

  }
}

.close-icon {
  position: absolute;
  top: 19px;
  right: 20px;
  z-index: 999;
  font-size: 14px;
  color: var(--color-primary-068);
  display: flex;
  justify-content: center;
  cursor: pointer;

  &:hover {
    color: var(--color-primary);
  }
}
</style>