export default {
'【{name}】已经发起过预处理，重新进行预处理会删除其对应的配准、前向处理、以及溯源定位结果，是否再次发起预处理？': '【{name}】已经发起过预处理，重新进行预处理会删除其对应的配准、前向处理、以及溯源定位结果，是否再次发起预处理？',
'是否对【{name}】发起预处理？': '是否对【{name}】发起预处理？',
'是否对【{name}】进行棘波检测？': '是否对【{name}】进行棘波检测？',

'删除患者 {name} 会同时删除患者的影像文件以及溯源结果，是否确定删除？':'删除患者 {name} 会同时删除患者的影像文件以及溯源结果，是否确定删除？',
'已勾选 {name} 个点，是否确认导出？': '已勾选 {name} 个点，是否确认导出？',
'确定删除【{name}】吗？': '确定删除【{name}】吗？',

'删除患者【{megId}】的同时，会删除患者的影像文件，是否确定删除？': '删除患者【{megId}】的同时，会删除患者的影像文件，是否确定删除？',
  pagination: {
    showTotal: '共 {total} 条记录'
  },
  modal: {
    confirmDelete: '确定删除【{name}】吗？'
  }
}